text = """ В Україні розташовані мальовничі Карпатські гори, які простягаються на заході країни і є частиною великої європейської гірської системи. Ці гори вражають своєю красою - тут знаходиться найвища точка України, гора Говерла (2061 метр), а також інші величні вершини як Петрос, Піп Іван, Ребра. Карпати славляться густими смерековими лісами, кришталево чистими гірськими ріками і озерами, живописними полонинами - високогірними луками, де влітку пасуть худобу місцеві пастухи. Особливо захоплюють туристів такі природні перлини як озеро Синевир, водоспад Шипіт, Буковель та інші гірськолижні курорти.
Окрім Карпат, в Україні є також Кримські гори на півдні півострова, які хоч і нижчі за Карпати, але не менш чарівні своєю унікальною красою. Найвища вершина Криму - Роман-Кош (1545 метрів) - розташована в Кримських горах, які створюють неповторний ландшафт узбережжя Чорного моря. Ці гори вирізняються особливим середземноморським кліматом, реліктовими лісами та унікальною флорою і фауною. Кримські гори менш масивні, ніж Карпати, але вони створюють драматичні берегові лінії з урвищами, затишними бухтами та історичними пам'ятками, що робить їх особливо привабливими для туристів і любителів історії. """

print("Виберіть функціонал: \n a- відрізати ділянку тексту \n b- отримати символ за номером\n c- додайти власний текст ")
option = input("Введіть вибрану функцію: ")
if option == "a":
    print("Введіть два числа: ")
    num1 = int(input("Початок зрізу: "))
    num2 = int(input("Кінець зрізу: "))
    if num2 > num1:
        print(text[num1:num2])
    else:   
        print("Введіть коректні дані!")
elif option == "b":
    number = int(input("Введіть номер символа: "))
    if 0 <= number < len(text):
        print(text[number])
elif option == "c":
    text_add = input("Введіть ваш текст: ")
    print(text + text_add)
else:
    print("Не вірна функція!")