    # task 1
# var_1 = 1
# var_2 = 2
# var_3 = 4
#
# sumOfVars = var_1 + var_2 + var_4
#
# print(sumOfvars)
var_1 = 1
var_2 = 2
var_3 = 4

sumOfVars = var_1 + var_2 + var_3

print(sumOfVars)

    # task 2
# «OMG,
# Python
# Work!»

print("\033[1m«OMG,\nPython\nWork!»\033[0m")

    # task 3
# Оголосіть три змінні і присвоїти першій числове значення, друга змінна дорівнює першій змінній збільшеної на 3,
# а третя змінна дорівнює сумі перших двох. Виведіть на екран значення кожної змінної.
a = 23
b = a * 3
c = a + b
print(c)

    # task 4
# *Поміняйте значення двох змінних місцями(уявіть, що ви на знаєте, що саме зберігається в цих змінних).

a = input('Введіть значення а:')
b = input('Введіть значення b:')
# ================
c = a
a = b
b = c

# ================
print(a)
print(b)