# 1. Дано рядок тексту, в якому слова розділені пропусками.
# Надрукуйте всі слова, які зустрічаються в тексті, та їхні частоти як у
# вихідних даних. Результатом поверніть словник.

# list_1 = "one two three one four five seven ten seven one"
# list_1 = list_1.split()

# dict_1 = {}

# for ls in list_1:
#     if ls not in dict_1:
#         dict_1[ls] = list_1.count(ls) 
# print(dict_1)




# 2. Напишіть програму для видалення кожного третього елемента із
# цілочисельного списку ідруку результуючого списку, доки список не стане
# порожнім. Початковий список цілих чисел вводиться в одному рядку через пропуск.

# # list_2 = [2, 5, 8, 9, 4, 78, 7, 1]
# list_2 = "2 5 8 9 4 78 7 1".split()
# ls = 2
# while ls < len(list_2):
#     list_2.pop(ls)
#     print(list_2)
#     if ls == len(list_2):
#         list_2.pop(0)
#         print(list_2)
# else:
#     list_2.pop(0)
#     print(list_2)

# 3. Використайте словник для виведення представлення букви, яку вводить
# користувач, у символах азбуки Морзе. Передбачте у програмі обробку малих і
# великих букв. *Зробіть програму, яка весь текст переводить в готову азбуку Морзе.

# morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',   
#          'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
#          'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••',
#          'm': '——', 'n': '—•', 'o': '———', 'p': '•——•',
#          'q': '——•—', 'r': '•—•', 's': '•••', 't': '—',
#          'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
#          'y': '—•——', 'z': '——••'}

# text = list(input("Enter your text: ").lower())
# text_morze = []

# for char in text:
#     if char in morze:
#         text_morze.append(morze.get(char))

# print(" ".join(text_morze))

